Revit 2027 API
Pipe.PipeSegment Property
 The pipe segment that was assigned to this pipe according to the routing preference.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeSegment PipeSegment { get; }
Public ReadOnly Property PipeSegment As PipeSegment
	Get
public:
property PipeSegment^ PipeSegment {
	PipeSegment^ get ();
}
member PipeSegment : PipeSegment with get
Property Value
PipeSegment
See Also
Reference
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace